backend/controllers/AdController.php

SELECT * FROM `lg_ad_category`
---
	        ->all();
	    $data['pages']=$pages;
	    // print_r($pages);die;
		$data['adcategory']=Adcategory::find()->all();

SELECT * FROM `lg_ad_category`
---
	public function actionAdd(){
		$data['model']=new Ad;
		$data['adcategory']=Adcategory::find()->all();

SELECT * FROM `lg_ad_category`
---
	public function actionPosition(){
		$data['adcategory']=Adcategory::find()->all();

SELECT * FROM `lg_ad_category` WHERE `category_id`='28'
---
	public function actionCateUpdate(){
		$id=Yii::$app->request->get('id');
		$data['res']=AdCategory::findOne($id);

INSERT INTO `lg_ad_category` (`categoryname`, `expense`) VALUES ('首页楼层广告2 ', 0)
---
	public function actionAddCateDo(){
		$arr=Yii::$app->request->post();
		$model = new AdCategory();
		$model->setAttributes($arr);
		$model->save();