frontend/controllers/CompanyController.php

    public function actionBlind2()
    {
        if(Yii::$app->request->isPost){
            $post=Yii::$app->request->post();
            $companyname=$post['companyName'];
            $session=Yii::$app->session;
            $userinfo=$session->get('user');
            $uid=$userinfo['uid'];
            $test=Company::find()->where(["u_id"=>$uid])->one();
---
SELECT * FROM `lg_company` WHERE `u_id`=32