frontend/controllers/IndexController.php

SELECT * FROM `lg_district` WHERE parentid = 0
SELECT * FROM `lg_category` WHERE c_alias = 'QS_scale'
---
	public function actionCompanyList()
    {
        $province_id=Yii::$app->request->get("province_id");
        $scale_id=Yii::$app->request->get("scale_id");
        $trade_id=Yii::$app->request->get("trade_id");
        $where="1=1";
        if($province_id!=''){
            $where.=" and district_id=$province_id";
        }
        if($scale_id!=''){
            $where.=" and scale_id=$scale_id";
        }
        if($trade_id!=''){
            $where.=" and trade_id=$trade_id";
        }
        $data['provincelist']=District::find()->where("parentid = 0")->asArray()->all();
        $data['scalelist']=Category::find()->where("c_alias = 'QS_scale'")->asArray()->all();
        $data['tradelist']=Category::find()->where("c_alias = 'QS_trade'")->asArray()->all();