frontend/controllers/ResumeController.php

    public function actionIndex()
    {
        //获取登陆的用户
        $userInfo = Yii::$app->session->get('user');

        //查询简历
        $resume = Resume::find()
            ->select('lg_resume.* , lg_user_photo.photo , lg_jobs_category.categoryname')
            ->join('INNER JOIN','lg_user_photo','photo_id = lg_user_photo.id')
            ->join('INNER JOIN','lg_jobs_category','intention_jobs_id = lg_jobs_category.id')
            ->where(['uid'=> $userInfo['uid'], 'audit' => 2])   //正式上线   $userInfo['uid']
            ->asArray()
            ->all();
---
SELECT `lg_resume`.*, `lg_user_photo`.`photo`, `lg_jobs_category`.`categoryname` FROM `lg_resume` INNER JOIN `lg_user_photo` ON photo_id = lg_user_photo.id INNER JOIN `lg_jobs_category` ON intention_jobs_id = lg_jobs_category.id WHERE (`uid`=49) AND (`audit`=2)

    public function actionCreate()
    {
        //获取session
        $userInfo = Yii::$app->session->get('user');


        //查询基本数据填充简历表
        $user = User::find()
            ->select('tel,tel_audit,email,email_audit,head_ic,lg_user_info.*')
            ->join('INNER JOIN','lg_user_info','id = user_id')
            ->where(['id' => $userInfo['uid']])  //正式上线   $userInfo['uid']
            ->asArray()
            ->one();
---
SELECT `tel`, `tel_audit`, `email`, `email_audit`, `head_ic`, `lg_user_info`.* FROM `lg_user` INNER JOIN `lg_user_info` ON id = user_id WHERE `id`=49

    public function actionUse()
    {
        //获取session
        $userInfo = Yii::$app->session->get('user');


        //状态查询
        $status = Yii::$app->request->get('status');
        if(!isset($status))
        {
            $status = [1,2,3,4];
        }
        //查询基本数据填充简历表
        $resumeInfo = Resume::find()
            ->select('title, wage, companyname, jobs_name, status, add_time, check_time, response_time')
            ->join('INNER JOIN','lg_resume_job','lg_resume.id = resume_id')
            ->join('INNER JOIN','lg_jobs','lg_jobs.id = job_id')
            ->where(['uid' => $userInfo['uid'], 'status' => $status])  //正式上线   $userInfo['uid']
            ->asArray()
            ->all();
---
SELECT `title`, `wage`, `companyname`, `jobs_name`, `status`, `add_time`, `check_time`, `response_time` FROM `lg_resume` INNER JOIN `lg_resume_job` ON lg_resume.id = resume_id INNER JOIN `lg_jobs` ON lg_jobs.id = job_id WHERE (`uid`=49) AND (`status` IN (1, 2, 3, 4))