frontend/controllers/UserController.php

    public function actionPhoto()
    {
        $upload = new UserPhoto();

        //多文件上传
        if (Yii::$app->request->isPost)
        {
            $upload->photo = UploadedFile::getInstances($upload, 'photo');

            if($fileArr = $upload->upload())
            {
                //入库
                foreach ($fileArr as $key => $val)
                {
                    $sql = "INSERT INTO lg_user_photo(id,user_id,photo) VALUES (null,'{$this->userInfo['uid']}','{$val}')";  ////上线更改$this->userInfo['uid']
                    Yii::$app->db->createCommand($sql)->execute();
                }
                $this->refresh();
            }
        }

        //状态查询
        $status = Yii::$app->request->get('status');
        if(!isset($status))
        {
            $status = [1,2,3];
        }

        //渲染模型
        $model = UserPhoto::find()
            ->where(['user_id' => $this->userInfo['uid'], 'status' => $status])
            ->asArray()
            ->all();
---
SELECT * FROM `lg_user_photo` WHERE (`user_id`=12) AND (`status` IN (1, 2, 3))