common/models/Category.php

SELECT `c_alias` FROM `lg_category` GROUP BY `c_alias`
---
    public function getList(){
        return $cate=Category::find()->groupBy(['c_alias'])->select('c_alias')->asArray()->all();

SELECT `c_id`, `c_name` FROM `lg_category` WHERE c_alias = 'QS_wage'
---
    public function getArray($c_alias){
        return $cate=Category::find()->select('c_id,c_name')->where("c_alias = '$c_alias'")->asArray()->all();