common/models/Hots.php

SELECT * FROM `lg_hots` ORDER BY `num` DESC LIMIT 10
---
    public function GetRankList(){
         $arr=Hots::find()->orderBy("num desc")->limit(10)->asArray()->all();

SELECT * FROM `lg_hots` WHERE way = '' and words = ''
---
    public function GetOne($where){
        $arr=Hots::find()->where($where)->asArray()->one();

SELECT * FROM `lg_hots` WHERE `id`='4'
UPDATE `lg_hots` SET `num`=258 WHERE `id`=4
---
    public function setAudit($id,$key,$value)
    {
        $data =Hots::find()->where(['id'=>$id])->one();
        $data->$key= $value;
        return $data->save();