common/models/Jobs.php

SELECT COUNT(*) FROM `lg_jobs` WHERE 1=1 and deadline > 1490313600 and jobs_name like '%ETO%' order by addtime desc
SELECT * FROM `lg_jobs` WHERE 1=1 and deadline > 1490313600 and jobs_name like '%ETO%' order by addtime desc LIMIT 10
---
    public function getAll($where)
    {
        $arr=Jobs::find()->select("*")->where($where);
        $pages = new Pagination(['totalCount' => $arr->count(),'pageSize'=>10]);
        $list=$arr->offset($pages->offset)->limit($pages->limit)->asArray()->all();