common/models/JobsCategory.php

SELECT * FROM `lg_jobs_category`
---
    public function select()
    {
        $cat_info = $this->find()->asArray()->all();