common/models/Resume.php

    public function select($u_id)
    {
        return $this->find()->where(['uid'=>$u_id])->all();
---
SELECT * FROM `lg_resume` WHERE `uid` IS NULL