common/models/User.php

UPDATE `lg_user` SET `last_login_time`=1490669993 WHERE `id`=49
---
    public function add($arr){
        $this->setAttributes($arr);
        $this->save($arr);

SELECT * FROM `lg_user` WHERE `email`='1179524828@qq.com'
---
    public function checkEmail($email){
        return $this->find()->where(['email'=>$email])->one();