backend/models/Company.php

    public function getList1($where)
    {
        $arr=Company::find()->select("id,companyname,logo,trade,scale,province")->where($where);
        $pages = new Pagination(['totalCount' => $arr->count(),'pageSize'=>6]);
        $list=$arr->offset($pages->offset)->limit($pages->limit)->asArray()->all();
---
SELECT COUNT(*) FROM `lg_company` WHERE 1=1 and district_id=8 and scale_id=85
SELECT `id`, `companyname`, `logo`, `trade`, `scale`, `province` FROM `lg_company` WHERE 1=1 and district_id=8 and scale_id=85 LIMIT 6

      public function getOne1($id)
    {
        return Company::find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `lg_company` WHERE `u_id`=33

    public function get($id)
    {
        return Company::find()->where(['u_id'=>$id])->one();
---
SELECT * FROM `lg_company` WHERE `u_id`=17