backend/models/Jobs.php

SELECT COUNT(*) FROM `lg_jobs` WHERE 1=1 and u_id=33 and deadline<1490697745
SELECT * FROM `lg_jobs` WHERE 1=1 and u_id=33 and deadline<1490697745 LIMIT 2
---
    public function getList($where)
    {
        $arr=Jobs::find()->where($where);
        $pages = new Pagination(['totalCount' => $arr->count(),'pageSize'=>2]);
        $list=$arr->offset($pages->offset)->limit($pages->limit)->asArray()->all();

SELECT * FROM `lg_jobs` WHERE `id`='24'
---
    public function getOne($id)
    {
        return Jobs::find()->where(['id'=>$id])->one();

SELECT * FROM `lg_jobs` LIMIT 5
---
     public function select()
    {
        return Jobs::find()->offset('0')->limit('5')->all();

SELECT * FROM `lg_jobs` ORDER BY `addtime` DESC LIMIT 5
---
     public function select1()
    {
        return $this->find()->offset('0')->limit('5')->orderBy('addtime DESC')->all();

SELECT COUNT(*) FROM `lg_jobs` WHERE (`u_id`=33) AND (`addtime` BETWEEN 1490630400 AND 1490716800)
---
    public function jobCount($id){
        $time1=strtotime(date('Y-m-d'));
        $time2=$time1+24*60*60;
        return Jobs::find()->where(['u_id'=>$id])->andWhere(['between', 'addtime', $time1, $time2])->count();

SELECT COUNT(*) FROM `lg_jobs` WHERE 1=1 and u_id=33 and deadline<1490697745
---
    public function getcount($where){
        return  Jobs::find()->where($where)->count();