backend/models/Members.php

SELECT * FROM `lg_members` WHERE `email`='1179524828@qq.com'
---
    public function checkEmail($email){
        return $this->find()->where(['email'=>$email])->one();

SELECT `points` FROM `lg_members` WHERE `uid`=17
---
    public function getPoint($id){
        return $this->find()->select('points')->where(['uid'=>$id])->one();