frontend/models/AdCategory.php

SELECT * FROM `lg_ad_category`
---
    public function Category()
    {
       return AdCategory::find()->asArray()->all();