frontend/models/Order.php

SELECT * FROM `lg_order`
---
    public function select()
    {
        return Order::find()->asArray()->all();