frontend/models/Points.php

SELECT * FROM `lg_points`
---
    public function select()
    {
        return Points::find()->asArray()->all();